[Timeout] BlockStatement
app/services/shared/csv-utils.ts:3:51
 import { APP_TIMEZONE } from '@domain/shared/constants/timezone';
 
-export function escapeCell(value: string): string {
-  if (/[",\n]/.test(value)) {
-    return `"${value.replace(/"/g, '""')}"`;
-  }
-  return value;
-}
+export function escapeCell(value: string): string {}
 
 /** Formats a Date in America/Sao_Paulo as DD/MM/YYYY HH:mm (24h), TZ-independent. */

[Timeout] ConditionalExpression
app/services/shared/csv-utils.ts:4:7
 import { APP_TIMEZONE } from '@domain/shared/constants/timezone';
 
 export function escapeCell(value: string): string {
-  if (/[",\n]/.test(value)) {
+  if (false) {
     return `"${value.replace(/"/g, '""')}"`;
   }

[Timeout] BlockStatement
app/services/shared/csv-utils.ts:4:29
 import { APP_TIMEZONE } from '@domain/shared/constants/timezone';
 
 export function escapeCell(value: string): string {
-  if (/[",\n]/.test(value)) {
-    return `"${value.replace(/"/g, '""')}"`;
-  }
+  if (/[",\n]/.test(value)) {}
   return value;
 }

[NoCoverage] BlockStatement
app/services/shared/csv-utils.ts:11:56
 }
 
 /** Formats a Date in America/Sao_Paulo as DD/MM/YYYY HH:mm (24h), TZ-independent. */
-export function formatDateBrasilia(date: Date): string {
-  const parts = new Intl.DateTimeFormat('pt-BR', {
-    timeZone: APP_TIMEZONE,
-    day: '2-digit',
-    month: '2-digit',
-    year: 'numeric',
-    hour: '2-digit',
-    minute: '2-digit',
-    hour12: false,
-  }).formatToParts(date);
-  const get = (type: string) => parts.find((p) => p.type === type)?.value ?? '';
-  return `${get('day')}/${get('month')}/${get('year')} ${get('hour')}:${get('minute')}`;
-}
+export function formatDateBrasilia(date: Date): string {}
 
 export function answerToString(value: unknown): string {

[NoCoverage] StringLiteral
app/services/shared/csv-utils.ts:14:10
 export function formatDateBrasilia(date: Date): string {
   const parts = new Intl.DateTimeFormat('pt-BR', {
     timeZone: APP_TIMEZONE,
-    day: '2-digit',
+    day: "",
     month: '2-digit',
     year: 'numeric',

[NoCoverage] StringLiteral
app/services/shared/csv-utils.ts:17:11
     day: '2-digit',
     month: '2-digit',
     year: 'numeric',
-    hour: '2-digit',
+    hour: "",
     minute: '2-digit',
     hour12: false,

[NoCoverage] BooleanLiteral
app/services/shared/csv-utils.ts:19:13
     year: 'numeric',
     hour: '2-digit',
     minute: '2-digit',
-    hour12: false,
+    hour12: true,
   }).formatToParts(date);
   const get = (type: string) => parts.find((p) => p.type === type)?.value ?? '';

[NoCoverage] ArrowFunction
app/services/shared/csv-utils.ts:21:44
     minute: '2-digit',
     hour12: false,
   }).formatToParts(date);
-  const get = (type: string) => parts.find((p) => p.type === type)?.value ?? '';
+  const get = (type: string) => parts.find(() => undefined)?.value ?? '';
   return `${get('day')}/${get('month')}/${get('year')} ${get('hour')}:${get('minute')}`;
 }

[NoCoverage] OptionalChaining
app/services/shared/csv-utils.ts:21:33
     minute: '2-digit',
     hour12: false,
   }).formatToParts(date);
-  const get = (type: string) => parts.find((p) => p.type === type)?.value ?? '';
+  const get = (type: string) => parts.find(p => p.type === type).value ?? '';
   return `${get('day')}/${get('month')}/${get('year')} ${get('hour')}:${get('minute')}`;
 }

[NoCoverage] StringLiteral
app/services/shared/csv-utils.ts:22:31
     hour12: false,
   }).formatToParts(date);
   const get = (type: string) => parts.find((p) => p.type === type)?.value ?? '';
-  return `${get('day')}/${get('month')}/${get('year')} ${get('hour')}:${get('minute')}`;
+  return `${get('day')}/${get("")}/${get('year')} ${get('hour')}:${get('minute')}`;
 }
 

[NoCoverage] StringLiteral
app/services/shared/csv-utils.ts:22:77
     hour12: false,
   }).formatToParts(date);
   const get = (type: string) => parts.find((p) => p.type === type)?.value ?? '';
-  return `${get('day')}/${get('month')}/${get('year')} ${get('hour')}:${get('minute')}`;
+  return `${get('day')}/${get('month')}/${get('year')} ${get('hour')}:${get("")}`;
 }
 

[Killed] BlockStatement
app/services/shared/csv-utils.ts:25:56
   return `${get('day')}/${get('month')}/${get('year')} ${get('hour')}:${get('minute')}`;
 }
 
-export function answerToString(value: unknown): string {
-  if (value === null || value === undefined) return '';
-  if (typeof value === 'string') return value;
-  if (typeof value === 'number' || typeof value === 'boolean') {
-    return String(value);
-  }
-  if (Array.isArray(value)) {
-    return value.map(answerToString).join('; ');
-  }
-  return JSON.stringify(value);
-}
+export function answerToString(value: unknown): string {}
 
killedBy: answerToString returns empty string for null/undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: undefined

[Killed] LogicalOperator
app/services/shared/csv-utils.ts:26:7
 }
 
 export function answerToString(value: unknown): string {
-  if (value === null || value === undefined) return '';
+  if (value === null && value === undefined) return '';
   if (typeof value === 'string') return value;
   if (typeof value === 'number' || typeof value === 'boolean') {
killedBy: answerToString returns empty string for null/undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "null"

[Killed] ConditionalExpression
app/services/shared/csv-utils.ts:26:7
 }
 
 export function answerToString(value: unknown): string {
-  if (value === null || value === undefined) return '';
+  if (true) return '';
   if (typeof value === 'string') return value;
   if (typeof value === 'number' || typeof value === 'boolean') {
killedBy: answerToString passes strings through
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello"
Received: ""

[Killed] ConditionalExpression
app/services/shared/csv-utils.ts:27:7
 
 export function answerToString(value: unknown): string {
   if (value === null || value === undefined) return '';
-  if (typeof value === 'string') return value;
+  if (false) return value;
   if (typeof value === 'number' || typeof value === 'boolean') {
     return String(value);
killedBy: answerToString passes strings through
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello"
Received: "\"hello\""

[Killed] EqualityOperator
app/services/shared/csv-utils.ts:27:7
 
 export function answerToString(value: unknown): string {
   if (value === null || value === undefined) return '';
-  if (typeof value === 'string') return value;
+  if (typeof value !== 'string') return value;
   if (typeof value === 'number' || typeof value === 'boolean') {
     return String(value);
killedBy: answerToString passes strings through
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello"
Received: "\"hello\""

[Killed] ConditionalExpression
app/services/shared/csv-utils.ts:28:7
 export function answerToString(value: unknown): string {
   if (value === null || value === undefined) return '';
   if (typeof value === 'string') return value;
-  if (typeof value === 'number' || typeof value === 'boolean') {
+  if (true) {
     return String(value);
   }
killedBy: answerToString joins arrays with "; "
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a; b"
Received: "a,b"

[Killed] EqualityOperator
app/services/shared/csv-utils.ts:28:7
 export function answerToString(value: unknown): string {
   if (value === null || value === undefined) return '';
   if (typeof value === 'string') return value;
-  if (typeof value === 'number' || typeof value === 'boolean') {
+  if (typeof value !== 'number' || typeof value === 'boolean') {
     return String(value);
   }
killedBy: answerToString joins arrays with "; "
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a; b"
Received: "a,b"
